CourseDesign.org
#+TITLE:高雄輔導團領域素養研習

* 國中課綱
*** 演算法(A)
- 7:資 A-IV-1 演算法基本概念。
- 8:資 A-IV-2 陣列資料結構的概念與應用。
- 8:資 A-IV-3 基本演算法的介紹。
*** 程式設計(P)
- 7:資 P-IV-1 程式語言基本概念、功能及應用。
- 7:資 P-IV-2 結構化程式設計。
- 8:資 P-IV-3 陣列程式設計實作。
- 8:資 P-IV-4 模組化程式設計的概念。
- 8:資 P-IV-5 模組化程式設計與問題解決實作。
*** 系統平台(S)
- 9:資 S-IV-1 系統平台重要發展與演進。
- 9:資 S-IV-2 系統平台之組成架構與基本運作原理。
- 9:資 S-IV-3 網路技術的概念與介紹。
- 9:資 S-IV-4 網路服務的概念與介紹。
*** 資料表示、處理及分析(D)
- 9:資 D-IV-1 資料數位化之原理與方法。
- 9:資 D-IV-2 數位資料的表示方法。
- 9:資 D-IV-3 資料處理概念與方法。
*** 資訊科技應用(T)
- 7:資 T-IV-1 資料處理應用專題。
- 9:資 T-IV-2 資訊科技應用專題。
*** 資訊科技與人類社會(H)
- 7:資 H-IV-1 個人資料保護。
- 7:資 H-IV-2 資訊科技合理使用原則。
- 7:資 H-IV-3 資訊安全。
- 8:資 H-IV-4 媒體與資訊科技相關社會議題。
- 8:資 H-IV-5 資訊倫理與法律。
- 9:資 H-IV-4 媒體與資訊科技相關社會議題。
- 9:資 H-IV-5 資訊倫理與法律。
- 9:資 H-IV-6 資訊科技對人類生活之影響。
- 9:資 H-IV-7 常見資訊產業的特性與種類。
* 高中課綱
*** 演算法(A)
- 資 A-V-1 重要資料結構的概念與應用。
- 資 A-V-2 重要演算法的概念與應用。
- 資 A-V-3 演算法效能分析。
*** 程式設計(P)
- 資 P-V-1 文字式程式設計概念與實作。
- 資 P-V-2 陣列資料結構的程式設計實作。
- 資 P-V-3 重要演算法的程式設計實作。
*** 系統平台(S)
- 資 S-V-1 系統平台之運作原理。
- 資 S-V-2 系統平台之未來發展趨勢。
*** 資料表示、處理及分析(D)
- 資 D-V-1 巨量資料的概念。
- 資 D-V-2 資料探勘與機器學習的基本概念。
*** 資訊科技應用(T)
- 資 T-V-1 數位合作共創的概念與工具使用。
*** 資訊科技與人類社會(H)
- 資 H-V-1 資訊科技的合理使用原則。
- 資 H-V-2 個人資料的保護。
- 資 H-V-3 資訊科技對人與社會的影響與衝擊。
* 銜接
|-------------------------+------------------------------------------------+-------------------------------------------|
| 主題                    | 國中                                           | 高中                                      |
|-------------------------+------------------------------------------------+-------------------------------------------|
| 演算法(A)               | 7:資 A-IV-1 演算法基本概念。                   | 資 A-V-1 重要資料結構的概念與應用。       |
|                         | 8:資 A-IV-2 陣列資料結構的概念與應用。         | 資 A-V-2 重要演算法的概念與應用。         |
|                         | 8:資 A-IV-3 基本演算法的介紹。                 | 資 A-V-3 演算法效能分析。                 |
|-------------------------+------------------------------------------------+-------------------------------------------|
| 程式設計(P)             | 7:資 P-IV-1 程式語言基本概念、功能及應用。     | 資 P-V-1 文字式程式設計概念與實作。       |
|                         | 7:資 P-IV-2 結構化程式設計。                   | 資 P-V-2 陣列資料結構的程式設計實作。     |
|                         | 8:資 P-IV-3 陣列程式設計實作。                 | 資 P-V-3 重要演算法的程式設計實作。       |
|                         | 8:資 P-IV-4 模組化程式設計的概念。             |                                           |
|                         | 8:資 P-IV-5 模組化程式設計與問題解決實作。     |                                           |
|-------------------------+------------------------------------------------+-------------------------------------------|
| 系統平台(S)             | 9:資 S-IV-1 系統平台重要發展與演進。           | 資 S-V-1 系統平台之運作原理。             |
|                         | 9:資 S-IV-2 系統平台之組成架構與基本運作原理。 | 資 S-V-2 系統平台之未來發展趨勢。         |
|                         | 9:資 S-IV-3 網路技術的概念與介紹。             |                                           |
|                         | 9:資 S-IV-4 網路服務的概念與介紹。             |                                           |
|-------------------------+------------------------------------------------+-------------------------------------------|
| 資料表示、處理及分析(D) | 9:資 D-IV-1 資料數位化之原理與方法。           | 資 D-V-1 巨量資料的概念。                 |
|                         | 9:資 D-IV-2 數位資料的表示方法。               | 資 D-V-2 資料探勘與機器學習的基本概念。   |
|                         | 9:資 D-IV-3 資料處理概念與方法。               |                                           |
|-------------------------+------------------------------------------------+-------------------------------------------|
| 資訊科技應用(T)         | 7:資 T-IV-1 資料處理應用專題。                 | 資 T-V-1 數位合作共創的概念與工具使用。   |
|                         | 9:資 T-IV-2 資訊科技應用專題。                 |                                           |
|-------------------------+------------------------------------------------+-------------------------------------------|
| 資訊科技與人類社會(H)   | 7:資 H-IV-1 個人資料保護。                     | 資 H-V-1 資訊科技的合理使用原則。         |
|                         | 7:資 H-IV-2 資訊科技合理使用原則。             | 資 H-V-2 個人資料的保護。                 |
|                         | 7:資 H-IV-3 資訊安全。                         | 資 H-V-3 資訊科技對人與社會的影響與衝擊。 |
|                         | 8:資 H-IV-4 媒體與資訊科技相關社會議題。       |                                           |
|                         | 8:資 H-IV-5 資訊倫理與法律。                   |                                           |
|                         | 9:資 H-IV-4 媒體與資訊科技相關社會議題。       |                                           |
|                         | 9:資 H-IV-5 資訊倫理與法律。                   |                                           |
|                         | 9:資 H-IV-6 資訊科技對人類生活之影響。         |                                           |
|                         | 9:資 H-IV-7 常見資訊產業的特性與種類。         |                                           |
|-------------------------+------------------------------------------------+-------------------------------------------|
* 課表
|-------------+----------------------------------|
| 08:40-09:00 | 報到                             |
| 09:00-10:30 | 資訊科技理念與素養導向課程設計   |
| 10:30-10:40 | 休息                             |
| 10:40-11:30 | 資料處理專題課程分享與實作（一)  |
| 11:30-11:40 | 休息                             |
| 11:40-12:30 | 資料處理專題課程分享與實作（二） |
|             | 學習評量方式探討                 |
|-------------+----------------------------------|
* web
- [[http://www.sggs.hc.edu.tw/sggsnew/premium/data/%E8%B7%A8%E9%A0%98%E5%9F%9F%E7%B4%A0%E9%A4%8A%E5%B0%8E%E5%90%91%E8%AA%B2%E7%A8%8B%E8%A8%AD%E8%A8%88%E6%89%8B%E5%86%8A.pdf][跨領域素養導向課程設計]]
- [[https://tech.nknu.edu.tw/UploadFile/OldData/news_file/mk_news_1071119%E7%B4%A0%E9%A4%8A%E5%B0%8E%E5%90%91%E5%B7%A5%E4%BD%9C%E6%95%99%E5%AD%B8(%E9%9F%8B%E9%82%91%E8%80%81%E5%B8%AB%E4%BF%AE%E8%A8%82)_66730933.pdf][素養導向教學工作坊]]
- [[http://ms2.ctjh.ntpc.edu.tw/~luti/110it_teaching_resource_20210803.html][108課綱科技領域資訊科技教材資源網2021第六版]]
- [[http://ms2.ctjh.ntpc.edu.tw/~luti/110ai3.htm][108課綱科技領域資訊科技-程式設計應用專題(人工智慧素養)]]
